/*
ΝΓΠ που να καταχωρεί τυχαίες τιμές από το 1 έως το 100 σε έναν τετραγωνικό (δισδιάστατο) πίνακα 5χ5.

Στη συνέχεια το πρόγραμμα να εκτυπώνει τα στοιχεία από το κάθε ένα από τα παρακάτω υποερωτήματα,
καθώς και το άθροισμα και το μέσο όρο για κάθε ένα από αυτά:

1. Όλα τα στοιχεία του πίνακα.

2. Τα στοιχεία του πίνακα που ανήκουν στην κύρια διαγώνιο.

3. Τα στοιχεία του πίνακα που ανήκουν στο άνω τρίγωνο της κύριας διαγωνίου (χωρίς την κύρια διαγώνιο).

4. Τα στοιχεία που ανήκουν στη δευτερεύουσα (ή ανάστροφη) διαγώνιο του πίνακα.

5. Τα στοιχεία που ανήκουν στο κάτω τρίγωνο της ανάστροφης διαγωνίου του πίνακα (χωρίς τη διαγώνιο).

6. Τα στοιχεία που ανήκουν στην ένωση του άνω τριγώνου της κύριας διαγωνίου και του κάτω τριγώνου της δευτερεύουσας.

7. Τα στοιχεία που ανήκουν στην τομή άνω τριγώνου της κύριας διαγωνίου, και του κάτω τριγώνου της δευτερεύουσας.

8. Τα στοιχεία που ανήκουν στη δεύτερη κατά το χρήστη γραμμή του πίνακα (γραμμή 1).

9. Τα στοιχεία που ανήκουν στις ζυγές κατά το χρήστη (μονές για εμάς) γραμμές του πίνακα.

10. Τα στοιχεία που ανήκουν (κατά το χρήστη) στις ζυγές γραμμές και μονές στήλες του πίνακα.

11. Τα στοιχεία του πίνακα που σχηματίζουν μια σκακιέρα, ξεκινώντας από το στοιχείο 0,1.

12. Τα στοιχεία του πίνακα που σχηματίζουν το γράμμα Ι.

13. Τα στοιχεία του πίνακα που σχηματίζουν το γράμμα T.

14. Τα στοιχεία του πίνακα που σχηματίζουν το γράμμα X.

15. Τα στοιχεία του πίνακα που σχηματίζουν το γράμμα Z.

16. Τα στοιχεία του πίνακα που σχηματίζουν το γράμμα N.

*/